1. Pivot Table
2. Pandas Concat
3. Pandas Merge
4. Pandas Join

In [48]:
data={'Country':['India','USA','Japan','China','India','USA'],
   'Year': ['2011','2011','2011','2019','2019','2019'],
     'Continent':['Asia','NA','Asia','Asia','Asia','NA'],
     'Value':[20,10,40,50,60,55]
    }

In [6]:
import pandas as pd

In [8]:
df=pd.DataFrame(data)

In [9]:
df

  Country  Year Continent  Value
0   India  2011      Asia     20
1     USA  2011        NA     10
2   Japan  2011      Asia     40
3   China  2019      Asia     50
4   India  2019      Asia     60
5     USA  2019        NA     55

In [11]:
pd.pivot_table(df,index=['Year'],aggfunc='sum')

      Value
Year
2011     70
2019    165

In [12]:
pd.pivot_table(df,index=['Continent'],aggfunc='sum')

           Value
Continent
Asia         170
NA            65

# Concat

In [14]:
people1={'id':[1,2,3,4],
        'name':['ABD','VK','KL','MSD'],
         'age':[40,34,29,40]
        }

people2={'id':[11,22,33,44],
        'name':['ABD','VK','RS','MSD'],
         'age':[40,34,36,40]
        }

people3={'id':[111,222,333,444],
        'name':['ABD','VK','RS','RP'],
         'age':[40,34,36,24]
        }

In [16]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [28]:
pd.concat([df3,df2,df1],ignore_index=True)

     id name  age
0   111  ABD   40
1   222   VK   34
2   333   RS   36
3   444   RP   24
4    11  ABD   40
5    22   VK   34
6    33   RS   36
7    44  MSD   40
8     1  ABD   40
9     2   VK   34
10    3   KL   29
11    4  MSD   40

In [19]:
pd.concat([df3,df2,df1],axis=1)

    id name  age  id name  age  id name  age
0  111  ABD   40  11  ABD   40   1  ABD   40
1  222   VK   34  22   VK   34   2   VK   34
2  333   RS   36  33   RS   36   3   KL   29
3  444   RP   24  44  MSD   40   4  MSD   40

In [21]:
people4={'id':[1,2,3,4],
        'name':['ABD','VK','KL','MSD'],
         'age':[40,34,29,40]
        }

people5={'id':[11,22,33,44],
        'name':['SKY','BA','IK','DK'],
         'sales':[405,346,367,408]
        }

In [22]:
df4=pd.DataFrame(people4)
df5=pd.DataFrame(people5)

In [37]:
pd.merge(df4,df5,on=['id','name'])

Empty DataFrame
Columns: [id, name, age, sales]
Index: []

In [27]:
pd.merge(df4,df5,on=['id'])

Empty DataFrame
Columns: [id, name_x, age, name_y, sales]
Index: []

In [33]:
people6={'id':[1,2,3,4],
        'name':['ABD','VK','KL','MSD'],
         'age':[40,34,29,40]
        }

people7={
        's_name':['KY','A','K','K'],
         'phn_no':[40534,32446,53367,35408]
        }

In [34]:
df6=pd.DataFrame(people6)
df7=pd.DataFrame(people7)

In [36]:
df6.join(df7)

   id name  age s_name  phn_no
0   1  ABD   40     KY   40534
1   2   VK   34      A   32446
2   3   KL   29      K   53367
3   4  MSD   40      K   35408

In [42]:
d1=pd.read_csv('myfile.tsv',sep='\t')
d1

       name  age  roll
0  'garvit'   19  2003
1   'bhuri'   19  2003
2  'bhumit'   18  2004
3   'harsh'   19  2003

In [45]:
d2=pd.read_csv('mysemi.txt',sep=';')
d2

       name  age  roll
0  'garvit'   19  2003
1   'bhuri'   19  2003
2  'bhumit'   18  2004
3   'harsh'   19  2003

# Creating a json file

In [49]:
df6

   id name  age
0   1  ABD   40
1   2   VK   34
2   3   KL   29
3   4  MSD   40

In [51]:
df6.to_json('myjson.json')

In [53]:
d4=pd.read_json('myjson.json')
d4

   id name  age
0   1  ABD   40
1   2   VK   34
2   3   KL   29
3   4  MSD   40

In [54]:
df5

   id name  sales
0  11  SKY    405
1  22   BA    346
2  33   IK    367
3  44   DK    408

In [55]:
df5.to_csv('mycsvvv.csv')